package student_igors.lesson_5.level_2;

import java.util.Arrays;

public class TaskTwelve {
    public static void main(String[] args) {

        int[] numbers = new int[3];
         numbers[0] = 5;
         numbers[1] = 13;
         numbers[2] = 7;
        System.out.println("Numbers is: " + Arrays.toString(numbers));
    }

}



//     Напишите программу, в которой:
//     - создайте массив целых чисел длиной 3,
//     - заполните каждую ячейку массива случайным числом,
//     - выведите значение каждой ячейки на консоль.
