/*
        Дан код, нужно сделать этот код запускаемым.
        Для сдачи работы создайте исправленный класс.

class LoginService {

    public void main(String[] args) {
        System.out.println("You can login!");
    }


}

 */

package student_jekaterina_soldatova.lesson02;

public class internTask07 {
}
