/*
        Создайте класс робот (Robot).

        Научите вашего робота "говорить" привет.

        Создайте в классе Robot метод со следующей сигнатурой:

public void sayHello() {
        // тут напишите команду распечатки на консоли строки "Hello!"
        }
*/

package student_jekaterina_soldatova.lesson_3.intern;

public class Robot {
    public void sayHello() {
        System.out.println("Hello there");
    }
}
